In [77]:
import seaborn as sns
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

### What do you need to learn

- loading data 
- selection 
    - cols
    - rows 
- manipulation 
    - add columns
    - remove columns
    - rename columns
    - change data type 
    - delete data 
    - remove duplicates 
    - sort
    - group
    - pivot
    - merge
- visualization

    - line plot
    - bar plot
    - histogram 
    - box plot
    - scatter plot
    - pie chart
    - heatmap
    - word cloud

In [78]:
penguins = sns.load_dataset('penguins')
penguins

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,Female
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,Male
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,Female
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,Male

- analysis 
   - univariate analysis
   - bi-variate analysis
   - multi-variate analysis

- loading data 
  - custom data from a variable 
  - excel data 
  - csv / json / etc
  - database(sql)

In [79]:
students = {
    'name': ['vaibhav', 'siya','aman','sneha ', 'aditi' , 'bhupendra'],
    'college' :['srmcem','srmcem', 'KMC','cu', 'srmcem', 'srmcem'],
    'dob' : ['13feb' , '20jan','21jun','15jan','17dec','22may']
}

sdf = pd.DataFrame(students)
sdf

        name college    dob
0    vaibhav  srmcem  13feb
1       siya  srmcem  20jan
2       aman     KMC  21jun
3     sneha       cu  15jan
4      aditi  srmcem  17dec
5  bhupendra  srmcem  22may

In [80]:
data = pd.read_excel('C:/Users/Bhuperndra Singh/Downloads/fruits.xlsx')
data

      Item  qty  amt
0   Apple   100    2
1   banana  400   50
2  orange    40   60

In [81]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Item    3 non-null      object
 1   qty     3 non-null      int64
 2   amt     3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes

In [82]:
data.columns.tolist()

['Item', 'qty', 'amt']

In [83]:
data['Item']

0     Apple
1     banana
2    orange
Name: Item, dtype: object

In [84]:
data.amt

0     2
1    50
2    60
Name: amt, dtype: int64

In [85]:
data[['Item', 'amt']]

      Item  amt
0   Apple     2
1   banana   50
2  orange    60

In [86]:
data['amt']* data['qty']

0      200
1    20000
2     2400
dtype: int64

In [87]:
data['total'] = data['amt'] * data['qty']
data

      Item  qty  amt  total
0   Apple   100    2    200
1   banana  400   50  20000
2  orange    40   60   2400

add coloumn

In [88]:
data ['crap'] = 'some crap'
data

      Item  qty  amt  total       crap
0   Apple   100    2    200  some crap
1   banana  400   50  20000  some crap
2  orange    40   60   2400  some crap

remove coloumn

In [89]:
data.drop(columns=['crap'], inplace = True )
data

      Item  qty  amt  total
0   Apple   100    2    200
1   banana  400   50  20000
2  orange    40   60   2400

In [90]:
data.iloc[0]

Item     Apple
qty         100
amt           2
total       200
Name: 0, dtype: object

In [91]:
data.iloc[:2]

     Item  qty  amt  total
0  Apple   100    2    200
1  banana  400   50  20000

In [92]:
data.drop(index =[1,2])

     Item  qty  amt  total
0  Apple   100    2    200

In [93]:
data

      Item  qty  amt  total
0   Apple   100    2    200
1   banana  400   50  20000
2  orange    40   60   2400

In [96]:
sdf.drop(index = [2,3])

        name college    dob
0    vaibhav  srmcem  13feb
1       siya  srmcem  20jan
4      aditi  srmcem  17dec
5  bhupendra  srmcem  22may

In [97]:
data ['qty'] = data['qty'] -10

In [98]:
data

      Item  qty  amt  total
0   Apple    90    2    200
1   banana  390   50  20000
2  orange    30   60   2400

In [102]:
data.rename(
    mapper ={'Item' : 'Product',
             'qty': 'quantity',
             'amt': 'Price',
             'total': 'Expenditure'},

    axis = 1,
    inplace = True         
)
data

   Product  quantity  Price  Expenditure
0   Apple         90      2          200
1   banana       390     50        20000
2  orange         30     60         2400